tap "daipeihust/tap"
tap "homebrew/bundle"
tap "supabase/tap"
brew "asciiquarium"
brew "bash"
brew "bat"
brew "cmatrix"
brew "coreutils"
brew "ctop"
brew "fish"
brew "gh"
brew "git"
brew "gtop"
brew "jq"
brew "libpq"
brew "neofetch"
brew "neovim"
brew "nyancat"
brew "tree"
brew "daipeihust/tap/im-select"
brew "supabase/tap/supabase"
cask "font-hack-nerd-font"
cask "hammerspoon"
cask "warp"
vscode "abusaidm.html-snippets"
vscode "adpyke.vscode-sql-formatter"
vscode "aeschli.vscode-css-formatter"
vscode "alefragnani.project-manager"
vscode "alexcvzz.vscode-sqlite"
vscode "arjun.swagger-viewer"
vscode "beardedbear.beardedtheme"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "coenraads.bracket-pair-colorizer-2"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "hediet.vscode-drawio"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "katsute.code-background"
vscode "koehlma.markdown-math"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mkvoya.eps-preview"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "oderwat.indent-rainbow"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sanaajani.taskrunnercode"
vscode "tinkertrain.theme-panda"
vscode "twxs.cmake"
vscode "vue.volar"
vscode "whizkydee.material-palenight-theme"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yzane.markdown-pdf"
vscode "zobo.php-intellisense"
